import type { BoardMember } from "@/types";

export const boardMembers: BoardMember[] = [
  {
    name: "سعود عبدالله النمري",
    role: "رئيس مجلس الإدارة",
    quote:
      "أعتقد أن مفتاح استدامة النجاح في جمعيتنا يكمن بالدرجة الأولى في تكريس مفهوم القيادة على جميع مستويات العمل، وتبنّي فكرة التنوّع، سواءٌ في برامجنا أو الأفراد الذين نعمل ونتعامل معهم، كمصدر أساسي للقوة. إلى جانب ذلك، نحرص دائماً على أن يوحّدنا هدف مشترك ونحن نعمل يداً بيد على تحقيق رؤيتنا ورسالتنا، وأن تكون النزاهة هي الإطار الذي يغلفها.",
  },
  {
    name: "بندر المقاطي",
    role: "نائب رئيس مجلس الإدارة",
    quote:
      "أعتقد أن مفتاح استدامة النجاح في جمعيتنا يكمن بالدرجة الأولى في تكريس مفهوم القيادة على جميع مستويات العمل، وتبنّي فكرة التنوّع، سواءٌ في برامجنا أو الأفراد الذين نعمل ونتعامل معهم، كمصدر أساسي للقوة.",
  },
  {
    name: "حسن حمدي",
    role: "مستشار الجمعية",
    quote:
      "أعتقد أن مفتاح استدامة النجاح في جمعيتنا يكمن بالدرجة الأولى في تكريس مفهوم القيادة على جميع مستويات العمل، وتبنّي فكرة التنوّع، سواءٌ في برامجنا أو الأفراد الذين نعمل ونتعامل معهم، كمصدر أساسي للقوة.",
  },
  {
    name: "عبدالله الجعيد",
    role: "عضو مجلس",
  },
  {
    name: "حسن الشريف",
    role: "عضو مجلس",
  },
  {
    name: "ماجد الجعيد",
    role: "عضو مجلس",
  },
  {
    name: "ثريا الغامدي",
    role: "عضو مجلس",
  },
];
