import type { Trail } from "@/types";

export const hikingTrails: Trail[] = [
  {
    slug: "darb-al-jamala",
    name: "مسار درب الجمالة",
    type: "hiking",
    distance: "8 كم",
    difficulty: "صعب",
    description:
      '"درب الجمالة" الحجري الذي يعود تاريخه إلى أكثر من 1000 عام، يعد إرثاً حضارياً وإنسانياً ذا قيمة تاريخية عظيمة، حيث كان يستخدمه المشاة حتى عام 1380هـ قبل إنشاء طريق الكر المزدوج الرابط بين الطائف والعاصمة المقدسة في التنقل ونقل البضائع والسلع والمنتجات الزراعية على ظهور الجمال.',
    details:
      "جبل كرا الفاصل بين سراة الطائف وتهامة مكة، كان يقف عقبة أمام حركة التنقل بين الحاضرتين الكبيرتين إلى أن ذللها وعمّرها حسين بن سلامة قبل ألف عام تقريباً، حيث شق لها دربين، واحدا للجمّالة، والآخر للمشاة، ورصفهما بالحجارة، فظهر الدرب منهما وهو على شكل درج يتلوى بين قمة الجبل في الهدا، والكر أسفل كرا مما يلي شداد، ثم وادي نعمان.",
    location: { lat: 21.35, lng: 40.35 },
  },
  {
    slug: "wadi-al-kharar",
    name: "هايكنج وادي الخرار",
    type: "hiking",
    distance: "6 كم",
    difficulty: "متوسط",
    description:
      "نفّذت جمعية مشاة الطائف ضمن البرنامج الزمني حسب روزنامة الأنشطة والفعاليات المعتمدة من وزارة الرياضة هايكنج وادي الخرار الخاص بأعضاء الجمعية رجال ونساء.",
    details:
      "مسار وادي المخاضة - نقطة التجمع الساعة ٦:١٥ صباحا طريق وادي وج بعد كوبري طريق الملك فهد الدائري مقابل محطة الدريس والانطلاق إلى مسار الهايكنج الساعة ٦:٤٥ وبداية الهايكنج الساعة ٧:١٥ صباحا لمدة ساعتان بعد ذلك تناول وجبة الفطور الساعة ٩:٣٠ والمعدة على شرفكم من قبل الجمعية وانتهاء البرنامج الساعة ١٠ صباحا.",
    gatheringPoint:
      "طريق وادي وج بعد كوبري طريق الملك فهد الدائري مقابل محطة الدريس",
    gatheringTime: "6:15 صباحاً",
    location: { lat: 21.3, lng: 40.55 },
  },
];
